In [93]:
import pandas as pd

In [94]:
info_etudiants_GL_IA ={
    "matricule":["2022020001","2021030045","2021030089","2021030065","20210300234"],
    "Nom":["Diev","patrick","erick","pasteur","junior"],
    "Age":[12,34,56,76,32],
    "GPA":["A","B","C","B","G"]  
}

In [95]:
data=pd.DataFrame(info_etudiants_GL_IA )

In [96]:
print(data)

     matricule      Nom  Age GPA
0   2022020001     Diev   12   A
1   2021030045  patrick   34   B
2   2021030089    erick   56   C
3   2021030065  pasteur   76   B
4  20210300234   junior   32   G

In [97]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   matricule  5 non-null      object
 1   Nom        5 non-null      object
 2   Age        5 non-null      int64
 3   GPA        5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [98]:
nom=data["Nom"]

In [99]:
print(nom)

0       Diev
1    patrick
2      erick
3    pasteur
4     junior
Name: Nom, dtype: object

In [100]:
data.iloc[3:4 ,1:2]

       Nom
3  pasteur

In [101]:
data2 = data["Age"]
data3=[]

In [102]:
for i in data2:
    if i > 60:
        data3.append(i)

In [103]:
print(data3)

[76]

In [104]:
data[data["Nom"] == "pasteur"]

    matricule      Nom  Age GPA
3  2021030065  pasteur   76   B

In [105]:
data[data["Age"] == 56]

    matricule    Nom  Age GPA
2  2021030089  erick   56   C

In [106]:
data[data["GPA"] =="B"]

    matricule      Nom  Age GPA
1  2021030045  patrick   34   B
3  2021030065  pasteur   76   B

In [107]:
data.isnull()

   matricule    Nom    Age    GPA
0      False  False  False  False
1      False  False  False  False
2      False  False  False  False
3      False  False  False  False
4      False  False  False  False

In [108]:
data.isnull().sum()

matricule    0
Nom          0
Age          0
GPA          0
dtype: int64

In [109]:
x= data.iloc[:,:1]

In [110]:
y = data.iloc[: , 2:3]

In [111]:
y

   Age
0   12
1   34
2   56
3   76
4   32

In [112]:
tab= pd.concat([x,y], axis=1)

In [113]:
tab

     matricule  Age
0   2022020001   12
1   2021030045   34
2   2021030089   56
3   2021030065   76
4  20210300234   32

In [115]:
data.drop(columns="Nom", axis=1)

     matricule  Age GPA
0   2022020001   12   A
1   2021030045   34   B
2   2021030089   56   C
3   2021030065   76   B
4  20210300234   32   G

In [ ]:
data

In [116]:
data["Age"]

0    12
1    34
2    56
3    76
4    32
Name: Age, dtype: int64